In [2]:
from sqlalchemy import create_engine
import pandas as pd
import getpass  # To get the password without showing the input
password = getpass.getpass()

········

In [38]:
connection_string = 'mysql+pymysql://root:' + password + '@localhost/bank'
engine = create_engine(connection_string)
import numpy as np

In [39]:
engine.execute("USE sakila")
query = "SELECT c.first_name, c.last_name, r.customer_id, count(r.rental_id) as nr_of_rentals \
FROM rentals_june as r \
join customer as c \
on r.customer_id = c.customer_id \
group by c.last_name \
order by customer_id asc"

In [40]:
query2 = "SELECT r.customer_id, count(r.rental_id) as nr_of_rentals \
FROM rentals_may as r \
join customer as c \
on r.customer_id = c.customer_id \
group by c.last_name \
order by customer_id asc"

In [41]:

def monthly_records(query,query2):
    querydf = pd.read_sql_query(query, engine)
    querydf = querydf.rename(columns={"nr_of_rentals": "june_nr_of_rentals"})
    querydf2 = pd.read_sql_query(query2, engine)
    querydf2= querydf2.rename(columns={"nr_of_rentals": "may_nr_of_rentals"})
    rentals_records=querydf.merge(querydf2, how='outer')
    rentals_records['june_nr_of_rentals'] = rentals_records['june_nr_of_rentals'].fillna(0)
    rentals_records['may_nr_of_rentals'] = rentals_records['may_nr_of_rentals'].fillna(0)
    may_list = rentals_records['may_nr_of_rentals'].tolist()
    june_list =  rentals_records['june_nr_of_rentals'].tolist()
    month=[]
    for i in range(len(june_list)):
        if may_list[i] > june_list[i]:
            month.append('may')
        elif june_list[i]> may_list[i]:
            month.append('june')
        else:
            month.append('same')
    rentals_records['month']=month
    return rentals_records

In [42]:
rentals_records=monthly_records(query,query2)

In [43]:
rentals_records.shape
rentals_records.head(25)

,first_name,last_name,customer_id,june_nr_of_rentals,may_nr_of_rentals,month
0,MARY,SMITH,1,7.0,2.0,june
1,PATRICIA,JOHNSON,2,1.0,1.0,same
2,LINDA,WILLIAMS,3,4.0,2.0,june
3,BARBARA,JONES,4,6.0,0.0,june
4,ELIZABETH,BROWN,5,5.0,3.0,june
5,JENNIFER,DAVIS,6,4.0,3.0,june
6,MARIA,MILLER,7,5.0,5.0,same
7,SUSAN,WILSON,8,3.0,1.0,june
8,MARGARET,MOORE,9,2.0,3.0,may
9,DOROTHY,TAYLOR,10,5.0,1.0,june
10,LISA,ANDERSON,11,3.0,1.0,june
11,NANCY,THOMAS,12,6.0,2.0,june
12,KAREN,JACKSON,13,4.0,0.0,june
13,BETTY,WHITE,14,1.0,5.0,may
14,HELEN,HARRIS,15,3.0,0.0,june
15,DONNA,THOMPSON,17,3.0,3.0,same
16,CAROL,GARCIA,18,4.0,3.0,june
17,RUTH,MARTINEZ,19,3.0,6.0,may
18,SHARON,ROBINSON,20,4.0,3.0,june
19,MICHELLE,CLARK,21,5.0,3.0,june
20,LAURA,RODRIGUEZ,22,1.0,3.0,may
21,SARAH,LEWIS,23,5.0,3.0,june
22,KIMBERLY,LEE,24,5.0,2.0,june
23,DEBORAH,WALKER,25,6.0,2.0,june
24,JESSICA,HALL,26,7.0,2.0,june

,first_name,last_name,customer_id,june_nr_of_rentals,may_nr_of_rentals,month
0,False,False,False,False,False,False
1,False,False,False,False,False,False
2,False,False,False,False,False,False
3,False,False,False,False,False,False
4,False,False,False,False,False,False
...,...,...,...,...,...,...
578,True,True,False,False,False,False
579,True,True,False,False,False,False
580,True,True,False,False,False,False
581,True,True,False,False,False,False
582,True,True,False,False,False,False